tap "buo/cask-upgrade"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "jesseduffield/lazygit"
tap "koekeishiya/formulae"
tap "mas-cli/tap"
tap "spring-io/tap"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# High performance key/value database
brew "berkeley-db", link: true
# GNU binary tools for native development
brew "binutils"
# Core application library for C
brew "glib"
# Cross-platform make
brew "cmake"
# Platform built on V8 to build network applications
brew "node"
# AST-based pattern checker for JavaScript
brew "eslint"
# Command-line fuzzy finder written in Go
brew "fzf"
# Glorious Glasgow Haskell Compilation System
brew "ghc"
# Distributed revision control system
brew "git"
# Alternative to top/htop
brew "glances"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# OpenType text shaping engine
brew "harfbuzz"
# Development kit for the Java programming language
brew "openjdk"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# Bash and Zsh completion for Gradle
brew "gradle-completion"
# Cross-platform program for developing Haskell projects
brew "haskell-stack"
# Improved top (interactive process viewer)
brew "htop"
# GNU utilities for networking
brew "inetutils"
# Manage your Java environment
brew "jenv"
# Featureful UNIX password cracker
brew "john"
# Simple terminal UI for git commands
brew "lazygit"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# Language Server for the Lua language
brew "lua-language-server"
# Mac App Store command-line interface
brew "mas"
# Java-based project management
brew "maven"
# Remote terminal application
brew "mosh"
# Open source relational database management system
brew "mysql"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Renders an animated, color, ANSI-text loop of the Poptart Cat
brew "nyancat"
# Library to simplify the interaction with PKCS#11
brew "pkcs11-helper"
# SSL/TLS VPN implementing OSI layer 2 or 3 secure network extension
brew "openvpn"
# General-purpose scripting language
brew "php"
# Reverse engineering framework
brew "radare2"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Send macOS User Notifications from the command-line
brew "terminal-notifier"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Anonymizing overlay network for TCP
brew "tor"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Vi 'workalike' with many additional features
brew "vim"
# Tool for creating isolated virtual python environments
brew "virtualenv"
# Internet file retriever
brew "wget"
# Access X11 clipboards from the command-line
brew "xclip"
# Download YouTube videos from the command-line
brew "youtube-dl"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Simple hotkey-daemon for macOS.
brew "koekeishiya/formulae/skhd"
# A tiling window manager for macOS based on binary space partitioning.
brew "koekeishiya/formulae/yabai"
# Distribution of the Python and R programming languages for scientific computing
cask "anaconda"
# Memory training application
cask "anki"
# Virtual Audio Driver
cask "blackhole-16ch"
# Virtual Audio Driver
cask "blackhole-2ch"
# Voice and text chat software
cask "discord"
# App to build and share containerized applications and microservices
cask "docker"
# Eclipse IDE for Java developers
cask "eclipse-java"
# Web browser
cask "firefox"
# Developer targeted fonts with a high number of glyphs
cask "font-hack-nerd-font"
# Desktop client for GitHub repositories
cask "github"
# Tools to protect your emails and files
cask "gpg-suite"
# IDE for Java development - community edition
cask "intellij-idea-ce"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Open-source firewall to block unknown outgoing connections
cask "lulu"
# Free and open-source RSS reader
cask "netnewswire"
# App to write, plan, collaborate, and get organized
cask "notion"
# Open-source software for live streaming and screen recording
cask "obs"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Collaboration platform for API development
cask "postman"
# Music streaming service
cask "spotify"
# Next generation tooling for Spring Boot
cask "springtoolsuite"
# Customizable email client
cask "thunderbird"
# IDE for TLA+
cask "tla-plus-toolbox"
# Web browser focusing on security
cask "tor-browser"
# Run commands and display their output on the desktop
cask "ubersicht"
# Virtual machines UI using QEMU
cask "utm"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
mas "Bitwarden", id: 1352778147
mas "GoodNotes", id: 1444383602
mas "KakaoTalk", id: 869223134
mas "Sequel Ace", id: 1518036000
mas "Shazam", id: 897118787
mas "StudyWatch", id: 1152962540
mas "WPS Office", id: 1468073139
mas "Xcode", id: 497799835
